In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.047427  0.113103  1.606269 -1.674140
2013-01-02 -0.277980  0.375217 -0.156901 -1.032729
2013-01-03 -0.206628  1.599714  1.046466  1.937567
2013-01-04  0.778649  0.290295 -0.176794 -0.731512
2013-01-05 -0.200330 -0.054672 -0.722958 -1.637767
2013-01-06  0.343666  1.017850 -2.049535  1.540249

In [9]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                         'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                         'D' : np.array([3] * 4,dtype='int32'),
                        'E' : pd.Categorical(["test","train","test","train"]),
                        'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -0.047427  0.113103  1.606269 -1.674140
2013-01-02 -0.277980  0.375217 -0.156901 -1.032729
2013-01-03 -0.206628  1.599714  1.046466  1.937567
2013-01-04  0.778649  0.290295 -0.176794 -0.731512
2013-01-05 -0.200330 -0.054672 -0.722958 -1.637767

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.778649  0.290295 -0.176794 -0.731512
2013-01-05 -0.200330 -0.054672 -0.722958 -1.637767
2013-01-06  0.343666  1.017850 -2.049535  1.540249

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
 df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values

array([[-0.04742738,  0.11310251,  1.60626929, -1.67413976],
       [-0.27797957,  0.37521676, -0.15690135, -1.03272878],
       [-0.20662792,  1.59971392,  1.04646588,  1.93756719],
       [ 0.77864906,  0.29029457, -0.17679404, -0.731512  ],
       [-0.20033009, -0.05467166, -0.72295757, -1.63776738],
       [ 0.34366623,  1.01785027, -2.04953547,  1.54024911]])

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.064992  0.556918 -0.075576 -0.266389
std    0.415068  0.628490  1.297695  1.599214
min   -0.277980 -0.054672 -2.049535 -1.674140
25%   -0.205053  0.157401 -0.586417 -1.486508
50%   -0.123879  0.332756 -0.166848 -0.882120
75%    0.245893  0.857192  0.745624  0.972309
max    0.778649  1.599714  1.606269  1.937567

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.047427   -0.277980   -0.206628    0.778649   -0.200330    0.343666
B    0.113103    0.375217    1.599714    0.290295   -0.054672    1.017850
C    1.606269   -0.156901    1.046466   -0.176794   -0.722958   -2.049535
D   -1.674140   -1.032729    1.937567   -0.731512   -1.637767    1.540249

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.674140  1.606269  0.113103 -0.047427
2013-01-02 -1.032729 -0.156901  0.375217 -0.277980
2013-01-03  1.937567  1.046466  1.599714 -0.206628
2013-01-04 -0.731512 -0.176794  0.290295  0.778649
2013-01-05 -1.637767 -0.722958 -0.054672 -0.200330
2013-01-06  1.540249 -2.049535  1.017850  0.343666

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -0.200330 -0.054672 -0.722958 -1.637767
2013-01-01 -0.047427  0.113103  1.606269 -1.674140
2013-01-04  0.778649  0.290295 -0.176794 -0.731512
2013-01-02 -0.277980  0.375217 -0.156901 -1.032729
2013-01-06  0.343666  1.017850 -2.049535  1.540249
2013-01-03 -0.206628  1.599714  1.046466  1.937567

In [21]:
df['A']

2013-01-01   -0.047427
2013-01-02   -0.277980
2013-01-03   -0.206628
2013-01-04    0.778649
2013-01-05   -0.200330
2013-01-06    0.343666
Freq: D, Name: A, dtype: float64

In [22]:
 df[0:3]

                   A         B         C         D
2013-01-01 -0.047427  0.113103  1.606269 -1.674140
2013-01-02 -0.277980  0.375217 -0.156901 -1.032729
2013-01-03 -0.206628  1.599714  1.046466  1.937567

In [23]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.277980  0.375217 -0.156901 -1.032729
2013-01-03 -0.206628  1.599714  1.046466  1.937567
2013-01-04  0.778649  0.290295 -0.176794 -0.731512

In [24]:
df.loc[dates[0]]

A   -0.047427
B    0.113103
C    1.606269
D   -1.674140
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.047427  0.113103
2013-01-02 -0.277980  0.375217
2013-01-03 -0.206628  1.599714
2013-01-04  0.778649  0.290295
2013-01-05 -0.200330 -0.054672
2013-01-06  0.343666  1.017850

In [26]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.277980  0.375217
2013-01-03 -0.206628  1.599714
2013-01-04  0.778649  0.290295

In [27]:
df.loc['20130102',['A','B']]

A   -0.277980
B    0.375217
Name: 2013-01-02 00:00:00, dtype: float64

In [28]:
df.loc[dates[0],'A']

-0.047427376643089235

In [29]:
df.at[dates[0],'A']

-0.047427376643089235

In [30]:
df.iloc[3]

A    0.778649
B    0.290295
C   -0.176794
D   -0.731512
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.778649  0.290295
2013-01-05 -0.200330 -0.054672

In [32]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.277980 -0.156901
2013-01-03 -0.206628  1.046466
2013-01-05 -0.200330 -0.722958

In [33]:
 df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.277980  0.375217 -0.156901 -1.032729
2013-01-03 -0.206628  1.599714  1.046466  1.937567

In [34]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.113103  1.606269
2013-01-02  0.375217 -0.156901
2013-01-03  1.599714  1.046466
2013-01-04  0.290295 -0.176794
2013-01-05 -0.054672 -0.722958
2013-01-06  1.017850 -2.049535

In [35]:
df.iloc[1,1]

0.37521676143368726

In [36]:
df.iat[1,1]

0.37521676143368726

In [37]:
df[df.A > 0]

                   A         B         C         D
2013-01-04  0.778649  0.290295 -0.176794 -0.731512
2013-01-06  0.343666  1.017850 -2.049535  1.540249

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.113103  1.606269       NaN
2013-01-02       NaN  0.375217       NaN       NaN
2013-01-03       NaN  1.599714  1.046466  1.937567
2013-01-04  0.778649  0.290295       NaN       NaN
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  0.343666  1.017850       NaN  1.540249

In [40]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.047427  0.113103  1.606269 -1.674140    one
2013-01-02 -0.277980  0.375217 -0.156901 -1.032729    one
2013-01-03 -0.206628  1.599714  1.046466  1.937567    two
2013-01-04  0.778649  0.290295 -0.176794 -0.731512  three
2013-01-05 -0.200330 -0.054672 -0.722958 -1.637767   four
2013-01-06  0.343666  1.017850 -2.049535  1.540249  three

In [41]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.206628  1.599714  1.046466  1.937567   two
2013-01-05 -0.200330 -0.054672 -0.722958 -1.637767  four

In [42]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [44]:
df['F'] = s1
df.at[dates[0],'A'] = 0
df.iat[0,1] = 0
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.606269  5  NaN
2013-01-02 -0.277980  0.375217 -0.156901  5  1.0
2013-01-03 -0.206628  1.599714  1.046466  5  2.0
2013-01-04  0.778649  0.290295 -0.176794  5  3.0
2013-01-05 -0.200330 -0.054672 -0.722958  5  4.0
2013-01-06  0.343666  1.017850 -2.049535  5  5.0

In [45]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.606269 -5  NaN
2013-01-02 -0.277980 -0.375217 -0.156901 -5 -1.0
2013-01-03 -0.206628 -1.599714 -1.046466 -5 -2.0
2013-01-04 -0.778649 -0.290295 -0.176794 -5 -3.0
2013-01-05 -0.200330 -0.054672 -0.722958 -5 -4.0
2013-01-06 -0.343666 -1.017850 -2.049535 -5 -5.0

In [46]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.606269  5  NaN  1.0
2013-01-02 -0.277980  0.375217 -0.156901  5  1.0  1.0
2013-01-03 -0.206628  1.599714  1.046466  5  2.0  NaN
2013-01-04  0.778649  0.290295 -0.176794  5  3.0  NaN

In [47]:
df1.dropna(how='any')

                  A         B         C  D    F    E
2013-01-02 -0.27798  0.375217 -0.156901  5  1.0  1.0

In [48]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.606269  5  5.0  1.0
2013-01-02 -0.277980  0.375217 -0.156901  5  1.0  1.0
2013-01-03 -0.206628  1.599714  1.046466  5  2.0  5.0
2013-01-04  0.778649  0.290295 -0.176794  5  3.0  5.0

In [49]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [50]:
df.mean()

A    0.072896
B    0.538067
C   -0.075576
D    5.000000
F    3.000000
dtype: float64

In [51]:
df.mean(1)

2013-01-01    1.651567
2013-01-02    1.188067
2013-01-03    1.887910
2013-01-04    1.778430
2013-01-05    1.604408
2013-01-06    1.862396
Freq: D, dtype: float64

In [52]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [53]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.206628  0.599714  0.046466  4.0  1.0
2013-01-04 -2.221351 -2.709705 -3.176794  2.0  0.0
2013-01-05 -5.200330 -5.054672 -5.722958  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [54]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.606269   5   NaN
2013-01-02 -0.277980  0.375217  1.449368  10   1.0
2013-01-03 -0.484607  1.974931  2.495834  15   3.0
2013-01-04  0.294042  2.265225  2.319040  20   6.0
2013-01-05  0.093711  2.210554  1.596082  25  10.0
2013-01-06  0.437378  3.228404 -0.453453  30  15.0

In [55]:
df.apply(lambda x: x.max() - x.min())

A    1.056629
B    1.654386
C    3.655805
D    0.000000
F    4.000000
dtype: float64

In [56]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    3
2    3
3    5
4    6
5    4
6    4
7    0
8    0
9    2
dtype: int32

In [57]:
s.value_counts()

4    2
3    2
2    2
0    2
6    1
5    1
dtype: int64

In [58]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [59]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.542510 -1.230258  0.690392 -0.433946
1  1.597034 -1.782387  2.452921  0.851271
2  0.605670  2.333859  0.265693  1.171506
3  1.974213 -0.325054  1.601510  0.021847
4  0.436178  0.526942  0.961349  0.645817
5  0.342535  0.476465 -0.409022  1.501172
6  2.549840 -1.755627  0.233811 -0.224311
7  0.375730  0.642496 -0.269493 -0.171201
8 -0.401883 -1.710362 -0.228306 -0.527688
9  0.703444  0.132702  0.316409 -1.508389

In [60]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.542510 -1.230258  0.690392 -0.433946
1  1.597034 -1.782387  2.452921  0.851271
2  0.605670  2.333859  0.265693  1.171506
3  1.974213 -0.325054  1.601510  0.021847
4  0.436178  0.526942  0.961349  0.645817
5  0.342535  0.476465 -0.409022  1.501172
6  2.549840 -1.755627  0.233811 -0.224311
7  0.375730  0.642496 -0.269493 -0.171201
8 -0.401883 -1.710362 -0.228306 -0.527688
9  0.703444  0.132702  0.316409 -1.508389

In [62]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [63]:
right

   key  rval
0  foo     4
1  foo     5

In [64]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [65]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [66]:
right

   key  rval
0  foo     4
1  bar     5

In [67]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [68]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.341484  1.220977 -0.226747  1.612968
1 -1.396583  0.532739 -0.791844 -0.210696
2  0.605692 -0.228823  2.170649 -2.185756
3 -1.115879  0.899126  0.467744  1.285809
4  1.269772  0.205658 -1.458791  1.284504
5  0.982878  0.744438 -1.223808  0.788071
6  1.216041  1.081822  1.441988 -0.552556
7 -1.156915  1.294427 -0.257507 -1.133503

In [69]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.341484  1.220977 -0.226747  1.612968
1 -1.396583  0.532739 -0.791844 -0.210696
2  0.605692 -0.228823  2.170649 -2.185756
3 -1.115879  0.899126  0.467744  1.285809
4  1.269772  0.205658 -1.458791  1.284504
5  0.982878  0.744438 -1.223808  0.788071
6  1.216041  1.081822  1.441988 -0.552556
7 -1.156915  1.294427 -0.257507 -1.133503
8 -1.115879  0.899126  0.467744  1.285809